

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительнаяОперация = СоздатьДокументыНаСервере(Объект.Период); 
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДокументыНаСервере(Дата)
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
						 "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыАкты", Дата);
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Объект.ТЧ.Очистить(); 
		
		МассивДанных = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого Элемент Из МассивДанных Цикл
			
			НоваяСтрока = Объект.ТЧ.Добавить();
			НоваяСтрока.Договор = Элемент.Договор;
			
			Если ПустаяСтрока(Элемент.Документ) Тогда
				НоваяРеализацияСсылка = СоздатьНовуюРеализацию(Элемент.Договор, Объект.Период);
				Элемент.Документ = НоваяРеализацияСсылка;
			КонецЕсли;
			
			НоваяСтрока.СсылкаНаДокументРеализация = Элемент.Документ;
			
		КонецЦикла;
		
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюРеализацию(Договор, Дата)
	
	ДанныеЗаполнения = Новый Структура("Договор, Дата", Договор, Дата);
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции

#КонецОбласти
