
#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьДокументыАкты(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, """") КАК Документ
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор)
	|			И (МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Дата))
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &Дата
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &Дата"
	;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Выборка = Запрос.Выполнить().Выбрать();
//	КоличествоСтрок = Выборка.Количество();
//	сч = 1;
	
	МассивДанных = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		ДоговорДокумент = Новый Структура;
		ДоговорДокумент.Вставить("Договор", Выборка.Договор);
		ДоговорДокумент.Вставить("Документ", Выборка.Документ);
		
		МассивДанных.Добавить(ДоговорДокумент);
		
//		ДлительныеОперации.СообщитьПрогресс(сч/КоличествоСтрок*100);
//		сч = сч + 1;
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти