
#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьДокументыАкты(Месяц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И МЕСЯЦ(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора) <= &Месяц
	|	И МЕСЯЦ(ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора) >= &Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0) КАК Документ,
	|	ВТ_Договоры.Ссылка КАК Договор
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Договоры.Ссылка = РеализацияТоваровУслуг.Договор
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &Месяц";
	
	Запрос.УстановитьПараметр("Месяц", Месяц);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Выборка = Запрос.Выполнить().Выбрать();
//	КоличествоСтрок = Выборка.Количество();
//	сч = 1;
	
	МассивДанных = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		ДоговорДокумент = Новый Структура;
		ДоговорДокумент.Вставить("Договор", Выборка.Договор);
		ДоговорДокумент.Вставить("Документ", Выборка.Документ);
		
		МассивДанных.Добавить(ДоговорДокумент);
		
//		ДлительныеОперации.СообщитьПрогресс(сч/КоличествоСтрок*100);
//		сч = сч + 1;
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти