#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ДатаОкончания) ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаНачала) Тогда
			Продолжить;
		КонецЕсли;
			Строка.ДнейВОтпуске = Цел((Строка.ДатаОкончания - Строка.ДатаНачала) / 86400);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	ПараметрыОткрытия.Вставить("Адрес2", ПоместитьВоВременноеХранилище(Объект.Год, УникальныйИдентификатор));
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыОткрытия, ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	ТабЗнач = Объект.ОтпускаСотрудников.Выгрузить();
	Адрес = ПоместитьВоВременноеХранилище(ТабЗнач, УникальныйИдентификатор);
	Возврат Адрес;

КонецФункции

#КонецОбласти

