#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
	                                И Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
		Элемент.Заголовок = "Действует с (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
		Элемент.Заголовок = "Действует по (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		Элемент.Заголовок = "Сумма абонентской платы (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		Элемент.Заголовок = "Стоимость часа работы (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
							   И Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") <> Неопределено Тогда
							   	
		Элементы.Удалить(Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора"));					   	
		Элементы.Удалить(Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора"));	
		Элементы.Удалить(Элементы.Найти("ВКМ_СуммаАбонентскойПлаты"));	
		Элементы.Удалить(Элементы.Найти("ВКМ_СтоимостьЧасаРаботы"));	
//			
//		РеквизитыФормы = ПолучитьРеквизиты();						   
//		УдаляемыеРеквизиты = Новый Массив;
//		Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
//			ИмяРеквизита = РеквизитФормы.Имя;
//			Если СтрНайти(ИмяРеквизита, "ВКМ_") Тогда
//				УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
//			КонецЕсли;
//		КонецЦикла;
//		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти








