#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере()
	
	Элемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
	Элемент.Заголовок = "Действует с (добавленный объект)";
	Элемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
	Элемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
	Элемент.Заголовок = "Действует по (добавленный объект)";
	Элемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
	Элемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	Элемент.Заголовок = "Сумма абонентской платы (добавленный объект)";
	Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
	Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	Элемент.Заголовок = "Стоимость часа работы (добавленный объект)";
	Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
    	Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора").Видимость = Истина;					   	
		Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора").Видимость = Истина;	
		Элементы.Найти("ВКМ_СуммаАбонентскойПлаты").Видимость = Истина;	
		Элементы.Найти("ВКМ_СтоимостьЧасаРаботы").Видимость = Истина;	
	Иначе	
		Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора").Видимость = Ложь;					   	
		Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора").Видимость = Ложь;	
		Элементы.Найти("ВКМ_СуммаАбонентскойПлаты").Видимость = Ложь;	
		Элементы.Найти("ВКМ_СтоимостьЧасаРаботы").Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти








